app/Controllers/Tickets.php

SELECT "id" AS "id", "description" AS "desc"
FROM "services"
---
    public function getServices()
{
    try {
        $db = \Config\Database::connect();
        $query = $db->table('services')->select('id AS id, description AS desc')->get()->getResult();

SELECT "id" AS "id", users.name || ' ' || users.last_name AS nombre
FROM "users"
WHERE "role_id" = 2
---
public function getUsuarios()
{
    try {
        $db = \Config\Database::connect();

        $query = $db->table("users")
            ->select("id AS id, users.name || ' ' || users.last_name AS nombre")
            ->where("role_id", 2)
            ->get()
            ->getResult();