app/Controllers/Usuarios.php

SELECT "id" AS "id", "name" AS "nombre"
FROM "roles"
---
    public function getTipo()
{
    try {
        $db = \Config\Database::connect();
        $query = $db->table('roles')->select('id AS id, name AS nombre')->get()->getResult();