app/Models/ServicesModel.php

SELECT "services".*, "services_classification"."name" as "tipo"
FROM "services"
JOIN "services_classification" ON "services_classification"."id" = "services"."idservice_classification"
WHERE "services"."is_active" = TRUE
---
public function getServiciosConJoin()
{
    $builder = $this->select('services.*, services_classification.name as tipo')
                    ->join('services_classification', 'services_classification.id = services.idservice_classification')
                    ->where('services.is_active', true);

    return $builder->findAll();