app/Models/TicketsModel.php

public function getTicketsConJoin()
{
    // Vista global del administrador: une usuarios tres veces con alias
    // porque un ticket tiene creador, tecnico asignado y usuario que cierra.
    return $this->select("
                tickets.*,
                s.description AS service_name,

                COALESCE(creator.name || ' ' || creator.last_name, 'Desconocido') AS creado_por,

                COALESCE(assigned.name || ' ' || assigned.last_name, 'Aún no asignado') AS asignado_a,

                COALESCE(closed.name || ' ' || closed.last_name, 'Aún no cerrado') AS cerrado_por
            ")
            ->join('users AS creator', 'creator.id = tickets.created_by') // siempre existe
            ->join('users AS assigned', 'assigned.id = tickets.assigned_to', 'left')
            ->join('users AS closed', 'closed.id = tickets.closed_by', 'left')
            ->join('services AS s', 's.id = tickets.service_id', 'left')
            ->findAll();
---
SELECT "tickets".*, "s"."description" AS "service_name", COALESCE(creator.name || ' ' || creator.last_name, 'Desconocido') AS creado_por, COALESCE(assigned.name || ' ' || assigned.last_name, 'Aún no asignado') AS asignado_a, COALESCE(closed.name || ' ' || closed.last_name, 'Aún no cerrado') AS cerrado_por
FROM "tickets"
JOIN "users" AS "creator" ON "creator"."id" = "tickets"."created_by"
LEFT JOIN "users" AS "assigned" ON "assigned"."id" = "tickets"."assigned_to"
LEFT JOIN "users" AS "closed" ON "closed"."id" = "tickets"."closed_by"
LEFT JOIN "services" AS "s" ON "s"."id" = "tickets"."service_id"