app/Models/UsuarioModel.php

SELECT "users".*, "roles"."name" as "tipo"
FROM "users"
JOIN "roles" ON "roles"."id" = "users"."role_id"
WHERE "users"."is_active" = TRUE
AND "users"."id" != '1'
---
public function getUsuariosConJoin($idExcluir = null)
{
    $builder = $this->select('users.*, roles.name as tipo')
                    ->join('roles', 'roles.id = users.role_id')
                    ->where('users.is_active', true);

    if (!is_null($idExcluir)) {
        $builder->where('users.id !=', $idExcluir);
    }

    return $builder->findAll();